Repository: msandroid/Cursor-Rule
Catalog: WhisperAX/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bn, de, es, fa, fr, hi, id, ja, ko, nl, pt, ru, sv, sw, ta, th, tr, ur, vi, zh

source: Your Analytics
ar: تحليلاتك
bn: আপনার বিশ্লেষণ
de: Ihre Analysen
es: Tus análisis
fa: تحلیل‌های شما
fr: Vos analyses
hi: आपका विश्लेषण
id: Analitik Anda
ja: あなたの分析
ko: 사용자 분석
nl: Uw Analytics
pt: Suas análises
ru: Ваша аналитика
sv: Din Analytics
sw: Uchambuzi Wako
ta: உங்கள் பகுப்பாய்வு
th: การวิเคราะห์ของคุณ
tr: Analitikleriniz
ur: آپ کا تجزیہ
vi: Phân tích của bạn
zh: 您的分析

# line.breaks.punctuation
source: Line Breaks on Punctuation
ar: فواصل الأسطر عند علامات الترقيم
bn: যতিচিহ্নে লাইন ব্রেক
de: Zeilenumbrüche bei Satzzeichen
es: Saltos de línea en puntuación
fa: شکست خط در نشانه‌های نگارشی
fr: Sauts de ligne sur la ponctuation
hi: विराम चिह्न पर लाइन ब्रेक
id: Jeda Baris pada Tanda Baca
ja: 句読点での改行
ko: 구두점에서 줄바꿈
nl: Regeleinden bij leestekens
pt: Quebras de linha na pontuação
ru: Переносы строк на знаках препинания
sv: Radbrytningar vid interpunktion
sw: Mivunjiko ya Mstari kwenye Alama za Uandishi
ta: நிறுத்தற்குறிகளில் வரி முறிவுகள்
th: การขึ้นบรรทัดใหม่ที่เครื่องหมายวรรคตอน
tr: Noktalama İşaretlerinde Satır Sonları
ur: اوقاف کے نشانات پر لائن بریک
vi: Ngắt dòng tại dấu câu
zh: 标点符号处换行

# line.breaks.punctuation.info
source: Automatically insert line breaks after periods (.) and Japanese periods (。) to improve text readability.
ar: إدراج فواصل الأسطر تلقائياً بعد النقاط (.) ونقاط اليابانية (。) لتحسين قابلية قراءة النص.
bn: পাঠযোগ্যতা উন্নত করতে দাগ (.) এবং জাপানি দাগ (。) এর পরে স্বয়ংক্রিয়ভাবে লাইন ব্রেক সন্নিবেশ করুন।
de: Automatisch Zeilenumbrüche nach Punkten (.) und japanischen Punkten (。) einfügen, um die Textlesbarkeit zu verbessern.
es: Insertar automáticamente saltos de línea después de puntos (.) y puntos japoneses (。) para mejorar la legibilidad del texto.
fa: به طور خودکار شکست خط را پس از نقطه (.) و نقطه ژاپنی (。) وارد کنید تا خوانایی متن بهبود یابد.
fr: Insérer automatiquement des sauts de ligne après les points (.) et les points japonais (。) pour améliorer la lisibilité du texte.
hi: पाठ की पठनीयता में सुधार के लिए पूर्ण विराम (.) और जापानी पूर्ण विराम (。) के बाद स्वचालित रूप से लाइन ब्रेक डालें।
id: Secara otomatis sisipkan jeda baris setelah titik (.) dan titik Jepang (。) untuk meningkatkan keterbacaan teks.
ja: 句点（.）と日本語の句点（。）の後に自動的に改行を挿入して、テキストの読みやすさを向上させます。
ko: 마침표(.)와 일본어 마침표(。) 후에 자동으로 줄바꿈을 삽입하여 텍스트 가독성을 향상시킵니다.
nl: Automatisch regeleinden invoegen na punten (.) en Japanse punten (。) om de leesbaarheid van tekst te verbeteren.
pt: Inserir automaticamente quebras de linha após pontos finais (.) e pontos japoneses (。) para melhorar a legibilidade do texto.
ru: Автоматически вставлять переносы строк после точек (.) и японских точек (。) для улучшения читаемости текста.
sv: Sätt in radbrytningar automatiskt efter punkter (.) och japanska punkter (。) för att förbättra textens läsbarhet.
sw: Kuingiza kiotomatiki mivunjiko ya mstari baada ya nukta (.) na nukta za Kijapani (。) kuboresha usomaji wa maandishi.
ta: உரையின் படிக்கும் தன்மையை மேம்படுத்த புள்ளிகள் (.) மற்றும் ஜப்பானிய புள்ளிகளுக்கு (。) பின் தானாக வரி முறிவுகளை சேர்க்கவும்.
th: แทรกการขึ้นบรรทัดใหม่โดยอัตโนมัติหลังจุด (.) และจุดญี่ปุ่น (。) เพื่อปรับปรุงความสามารถในการอ่านข้อความ
tr: Metin okunabilirliğini artırmak için noktalardan (.) ve Japonca noktalardan (。) sonra otomatik olarak satır sonları ekleyin.
ur: متن کی پڑھنے کی صلاحیت کو بہتر بنانے کے لیے نقطوں (.) اور جاپانی نقطوں (。) کے بعد خودکار طور پر لائن بریک داخل کریں۔
vi: Tự động chèn ngắt dòng sau dấu chấm (.) và dấu chấm tiếng Nhật (。) để cải thiện khả năng đọc văn bản.
zh: 在句号（.）和日文句号（。）后自动插入换行，以提高文本可读性。

source: Line Spacing
ar: تباعد الأسطر
bn: লাইন স্পেসিং
de: Zeilenabstand
es: Espaciado de líneas
fa: فاصله بین خطوط
fr: Espacement des lignes
hi: लाइन स्पेसिंग
id: Spasi Baris
ja: 行間隔
ko: 줄 간격
nl: Regelafstand
pt: Espaçamento de linhas
ru: Межстрочный интервал
sv: Radavstånd
sw: Nafasi ya Mstari
ta: வரி இடைவெளி
th: ระยะห่างระหว่างบรรทัด
tr: Satır Aralığı
ur: لائن اسپیسنگ
vi: Khoảng cách dòng
zh: 行间距

# line.spacing.info
source: Controls the spacing between lines when line breaks are enabled. Higher values create more space between lines.
ar: يتحكم في التباعد بين الأسطر عند تمكين فواصل الأسطر. القيم الأعلى تخلق مساحة أكبر بين الأسطر.
bn: লাইন ব্রেক সক্ষম করা হলে লাইনের মধ্যে স্পেসিং নিয়ন্ত্রণ করে। উচ্চ মান লাইনের মধ্যে আরও স্থান তৈরি করে।
de: Steuert den Abstand zwischen Zeilen, wenn Zeilenumbrüche aktiviert sind. Höhere Werte erzeugen mehr Platz zwischen den Zeilen.
es: Controla el espaciado entre líneas cuando los saltos de línea están habilitados. Los valores más altos crean más espacio entre líneas.
fa: فاصله بین خطوط را زمانی که شکست خط فعال است کنترل می‌کند. مقادیر بالاتر فضای بیشتری بین خطوط ایجاد می‌کند.
fr: Contrôle l'espacement entre les lignes lorsque les sauts de ligne sont activés. Des valeurs plus élevées créent plus d'espace entre les lignes.
hi: जब लाइन ब्रेक सक्षम होते हैं तो लाइनों के बीच स्पेसिंग को नियंत्रित करता है। उच्च मान लाइनों के बीच अधिक स्थान बनाते हैं।
id: Mengontrol jarak antara baris ketika jeda baris diaktifkan. Nilai yang lebih tinggi menciptakan lebih banyak ruang antar baris.
ja: 改行が有効になっているときの行間隔を制御します。値が大きいほど行間のスペースが広くなります。
ko: 줄바꿈이 활성화되어 있을 때 줄 사이의 간격을 제어합니다. 값이 높을수록 줄 사이의 공간이 더 많아집니다.
nl: Regelt de afstand tussen regels wanneer regeleinden zijn ingeschakeld. Hogere waarden creëren meer ruimte tussen regels.
pt: Controla o espaçamento entre linhas quando as quebras de linha estão habilitadas. Valores mais altos criam mais espaço entre as linhas.
ru: Управляет интервалом между строками, когда включены переносы строк. Более высокие значения создают больше места между строками.
sv: Kontrollerar avståndet mellan rader när radbrytningar är aktiverade. Högre värden skapar mer utrymme mellan rader.
sw: Hudhibiti nafasi kati ya mistari wakati mivunjiko ya mstari imewezeshwa. Maadili ya juu huunda nafasi zaidi kati ya mistari.
ta: வரி முறிவுகள் இயக்கப்பட்டிருக்கும் போது வரிகளுக்கிடையிலான இடைவெளியை கட்டுப்படுத்துகிறது. அதிக மதிப்புகள் வரிகளுக்கிடையில் அதிக இடத்தை உருவாக்குகின்றன.
th: ควบคุมระยะห่างระหว่างบรรทัดเมื่อเปิดใช้งานการขึ้นบรรทัดใหม่ ค่าที่สูงกว่าจะสร้างพื้นที่มากขึ้นระหว่างบรรทัด
tr: Satır sonları etkinleştirildiğinde satırlar arasındaki boşluğu kontrol eder. Daha yüksek değerler satırlar arasında daha fazla alan yaratır.
ur: جب لائن بریک فعال ہوں تو لائنوں کے درمیان فاصلے کو کنٹرول کرتا ہے۔ اعلیٰ اقدار لائنوں کے درمیان زیادہ جگہ بناتی ہیں۔
vi: Kiểm soát khoảng cách giữa các dòng khi ngắt dòng được bật. Giá trị cao hơn tạo ra nhiều khoảng trống hơn giữa các dòng.
zh: 在启用换行时控制行间距。较高的数值会在行之间创建更多空间。

source: Scribe
fa: اسکرایب
ta: ஸ்கிரைப்
